[
    "Крутой джазовый бар проводит конкурс на лучшего исполнителя, которого возьмут на работу. Собирается толпа музыкантов и среди них старый программист.\nВыходит и говорит:\n— Эта песня называется \"Я буду дрочить на тебя всю ночь!\"\nИграет восхитительный блюз, после которого половина музыкантов сразу собираются и уходят, другие просто плачут от восторга!\nСтарый программист говорит:\n— А следующая моя песня называется \"Соси у меня, сука, пока я не кончу!\"\nИ играет блюз еще круче от которого оставшиеся музыканты единогласно отказываются от участия в конкурсе.\nВлдаделец заведения говорит\n— Мы вас берем, только не могли бы вы не называть своих песен, а они немного… ммм.. шокируют.\nПрограммист соглашается.\nИдет очердной концерт, главный исполнитель видимо забыл запрвиться, у него елда торчит из штанов, он садится за рояль, играет. Хозяин заведения замечает эту оплошность, подходит к нему, говорит:\n— У тебя хуй торчит наружу, знаешь?\nПрограммист\n— Что? Знаю ли я её?! Да я её написал!!",
    "Умирает старый богатый корсиканец.\nСобралась семья, ждут, кого же старик объявит наследником. По старой доброй корсиканской традиции всё должен унаследовать самый ленивый. Умирающий слабым голосом:\n- Доминик, сын мой, подойди ко мне.\nДоминик подходит.\n- Сынок, представь, что ты сидишь и видишь, как ветер гонит купюру в 500 франков. Что ты сделаешь?\n- Не сдвинусь с места, папа. Зачем мне лишний раз утомляться?\n- Золотые слова, мой мальчик. ступай. Паоло, подойди.\nподходит Паоло.\n- Паоло, обнажённая страстная красавица тянет к тебе руки. Что ты сделаешь?\n- Не пошевелюсь. К чему напрягаться лишний раз?\n- прекрасный ответ, сынок. Ступай. Антонио, подойди.\n- Сам подойди.",
    "Родительское собрание в школе. Учитель говорит отцу:\n-Знаете, ваш Вовочка ужасно себя ведёт! Хулиганит, матом ругается, девочкам проходу не даёт, вчера даже пьяный пришёл!\n-Ну Вовка, убью нахуй!\nНа следующем собрании:\n-Что вы такое сказали сыну, что он уже 2 недели в школу не ходит?\n-Так я его убил нахуй!",
    "Гуляет девочка с собакой, а мимо идет женщина.\nЖенщина спрашивает: \"Девочка, а как тебя зовут?\"\n-Роза\n-Какое красивое имя, а почему тебя так назвали?\n-Когда я родилась, мой папа подарил моей маме розовое масло, а капелька этого масла упала мне на лоб.\n-Какая красивая история, а как зовут твоего песика?\n-Хряк\n-А почему его так назвали?\n-Он свиней ебет",
    "Геолог спрашивает чукчу-пастуха:\n- Отец, скажи, а сколько твои олени дают\nза сезон рогов?\n- Черные или белые?\n- Ну, допустим черные.\n- А-а-а-а... Черные - два килограмма.\n- А белые?\n- И белые два килограмма.\n- А скажи, отец, сколько им нужно корма в\nдень?\n- Черным или белым? - уточняет пастух\n- Ну, черным.\n- Черным - один килограмм.\n- А белым? - не унимается геолог.\n- И белым один килограмм.\nГеолог в бешенстве:\nТы что меня заморачиваешь? Почему все\nвремя спрашиваешь, черные или белые, ведь результат один и тот-же?\n- Ну-у-у... Так ведь черные-ж мои, - отвечает\nчукча.\nГеолог понимающе:\nА-а-а-а-а.... А белые?\n- И белые мои.",
    "Кавказская притча\n\nДиалог отца и сына:\n– Сын, у тебя есть лучший друг?\n– Есть.\n– Давай я докажу тебе, что у тебя нету лучшего друга.\n– Давай.\n– Иди в поле, зарежь барашка, кинь в мешок, и прийди к другу в 4 часа утра и скажи \"я зарезал человека, пошли со мной хоронить?\"\nСын все так и сделал\nНа что ему ответил друг:\n– Прости, но мне надо с девушкой погулять.\nПриходит папа и говорит:\n– Ну что, как твой друг отреагировал?\n– Не знаю, сказал что с девушкой.\n– Теперь пошли со мной:\nОтец режет барашка, кидает в мешок, идет отец к своему другу в 4 часа утра и говорит:\n– Брат, я зарезал человека, что делать?\nТот отвечает:\n–Не ты убил, мы убили!\nИ выебал барана",
    "Выбирает зоофил собаку:\n-Вам какой породы?\n-Мне поебать.",
    "Средние века. По морю плывет корабль. Матрос, сидящий на мачте, кричит:\n— Капитан! Впереди по курсу пиратский корабль!\n— Принесите мне мою красную рубаху! — спокойном голосом отдает приказ капитан.\nКоманда удивлена, но приносят ему рубаху, он надевает её. Завязывается бой, в ходе которого пираты оказываются полностью разгромлены.\n— Капитан, а скажите нам, зачем вы попросили красную рубаху?\n— Это для того, чтобы, если я окажусь ранен в бою, моя команда не видела мою кровь и продолжала так же отважно сражаться.\n— Капитан! Впереди по курсу 20 пиратских кораблей!!!\n— Принесите мои коричневые штаны! — все так же спокойно приказывает капитан.",
    "Идет еврей, видит, два араба палками ковер выбивают...\n— Шо, не заводится?",
    "Заходит парень в кафе и читает прейскурант: \n+ Пирожок с капустой — 50 р.\n+ Подрочить — 500 р.\nСмотрит, за прилавком стоит продавщица — сногсшибательная блондинка.\nПарень:\n— Извините, а кто у вас дрочит?\nБлондинка с томной улыбкой на устах:\n— Я, а что?\nПарень:\n— Тогда вымойте, пожалуйста, руки. Мне пирожок с капустой.",
    "Решила Белоруссия отмстить США за издевательство над славянским народом.\nДолго думали, как им отомстить!\nДолго думали, решали, как быть, и наконец придумали.\nУдарить по США ядерными ракетами!\nА после ответа США, Россия их сотрёт с лица земли!\nНашли на старых советских складах ядерные боеголовки, купили ракеты и выбрали цель.\nИ наконец запустили ракету по Вашинготну. Бдыщщщ!!!\nНет больше города, весь в руинах, пылает...\nЗалезли белорусы в бомбоубежища и ждут ответа.\nПроходит неделя, другая... Тишина.\nРешили запустить ещё одну... Бдыщщщ! Нет Нью Йорка.\nОпять ждут неделю, две... И тишина.\nТут все белорусы стали считать себя самой грозной нацией, что даже США их боится! Боится отвечать! Нужно с ними кончать!\nИ наконец решили запустить последнюю ракету по Пентагону!\nЗапустили, ракета летит, а в это время в самом Пентагоне все высокопоставленные лица склонили головы над картой мира и громко орут: Где эта ёбаная Белоруссия?!?!?",
    "Грузин поймал мужика, посадил на цепь и ебать собирается:\n— Тебя как ебать, с вазелином или без?\n— Без вазелина.\nНу, грузин его отодрал. В следующий раз снова грузин спрашивает:\n— Тебя как ебать, с вазелином или без?\nНу мужик думает, очко болит, лучше уж с вазелином:\n— С вазелином, еби.\nГрузин:\n— Вазелин, заходи.",
    "Отец Вовочки у директора:\n- Понимаете, Ваш сын, мало того что отвратительно учится, он ещё и ведет себя абсолютно неподобающе!\n- Ну это возраст, это нормально\n- Но он выебал козу!\n- Я с ним поговорю.\nВыходит в коридор и говорит Вовочке:\n- Это что значит - маму вдвоём, а козу один?",
    "Отправили на работы за территорию воинской части четырёх бойцов и прапорщика.\nПосле окончания работ прапор построил бойцов и считает:\n- Раз, два, три, четыре. Нас было пятеро. Где пятый? Ищем пятого. Разойдись!\nПроходит десять минут. Опять построение, та же история, следует команда \"Разойдись! Ищем пятого\".\nПосле третьего построения один боец говорит:\n- Товарищ прапорщик, давайте я посчитаю, а вы становитесь в строй.\nСчитает: \"Раз, два, три, четыре\", и, показывая на себя - ПЯТЬ!\nПрапор подходит к этому бойцу, отвешивает ему подзатыльник и говорит:\n- Так это мы тебя, урод, полчаса искали?!",
    "Заходит брат к сестре и видит, как она голая перед зеркалом поговаривает:\n— Мм, мужика бы сейчас!\nНа следующий день видит, как её десять мужиков ебут. Он не растерялся, пришел к себе в комнату, разделся, и перед зеркалом:\n— Мм, пельменей бы сейчас!\nНа следующий день сестра заходит к нему в комнату, а его десять пельменей ебут.",
    "Грузин тонет. Видит, по берегу русский идёт. А грузин забыл, как по-русски будет \"тону\". Ну и кричит русскому:\n— Э, сущии, паслэдни рас купаюсь. Абыдна, да?",
    "Идут два сантехника на вызов. Один матёрый, второй юнец стажёр. Подходят к месту, там люк, из него говно хлещет,все вокруг затоплено. Ну значит матёрый одевается, ныряет внутрь.\nМинуту нет, две. Выниривает и говорит:\n- Стажёр! ключ на 18!\nМалец даёт ему ключ, сантехник снова ныряет. Через 5 минут выныривает:\n- ключ на 16!\nНыряет снова. Через пару минут говно перестало идти, из люка вылазит сантехник, весь в дерьме, одни глаза только видно. Садится на край, закуривает и говорит:\n- вот, учись студент! А то так и будешь всю жизнь ключи подавать...",
    "Едет араб на верблюде в пустыне,а верблюд двигается очень медленно.Араба это заебало и он думает,что это надо как-то решать.Видит стоит автосервис,заглядывает в него,и просит механика:\n-сделайте пожалуйста так,чтобы мой верблюд двигался быстрее,я не могу передвигаться на нем с такой минимальной скоростью\nМеханик кивнул головой и сказал:\n- На эстокаду.\nВерблюда подняли на эстокаде, механик встал под верблюдом, взял два молотка и ударил по яйцам верблюда соприкоснувшись молотками.\nВерблюд как улетит с сервиса со скоростью света,что аж через 3 секунды не было видно его на горизонте.\nАраб стоит в ахуе и говорит:\n-Ты че наделал блять,как мне теперь его догнать ?!?!\nНа что механик отвечает:\n- На эстокаду.",
    "У рядового Иванова умер отец. Пришла телеграмма в часть. Полковник вызывает старшину и говорит:\n— Слушай, такое дело, ты скажи Иванову про отца, только как-нибудь поделикатней.\n— Будет сделано!",
    "Старшина выстраивает роту и говорит:\n— У кого живы отцы шаг вперед. Иванов! Ну ты-то куда прешь?",
    "В семье лошадей случилось горе.\nОтца цыгане спиздили.",
    "В семье сантехников произошло горе.\nОтец смылся",
    "Приходит мужик в ресторан, заказывает суп и горячее, официант несёт ему суп и держит палец в супе. Мужик офигел конечно, но голодный был, съел молча суп. Потом смотрит официант горячее несёт, и палец опять в пюрешку засунул. Ну тут мужик уже не выдержал и спросил:\n- Cлушай, нахера ты палец в еду все время суешь?\n- Я палец порезал, врач сказал все время в тепле держать, чтоб гангрены не было.\n- Так ты себе палец в жопу засунь, там тепло.\n- А я на обратном пути так и делаю!",
    "В Ереванское КБ приезжает японская делегация. Главный инженер-армянин рассказывает:\n— Вот тут у нас сидят 8 инженеров, вот тут 12, вот тут 16.\nЯпонец:\n— А у нас на весь завод приходится всего 7 инженеров!\nДелегация уезжает, главный инженер задумчиво идёт домой, задумчиво ужинает, ложится в кровать, ворочается полночи и думает:\n— Ну шесть понятно. А с кем седьмой в нарды играет?!",
    "Таджикский режиссер снял трусы",
    "Е@уться два гомика в кустах ночью. Один другому говорит:\n-Ты такой опытный, я ещё не с кем так!\n-Ну спасиба!\n— А ты с какой улицы?\n— Заречная!\n-Блин и я!!! А с какого дома?\n-56!\n-Ха! И я тоже! А подъезд какой?\n-3!\n-Прикинь и я тоже!!! А квартира какая?\n-37!\n-Папа?\n-Эдик?о_О",
    "Идёт крейсер по морю. Тут капитан замечает вражескую торпеду, идущую прямо в борт корабля и зовёт боцмана:\n- Боцман, зайди в трюм и отвлекли команду чтобы никто панику не поднял!\n\nБоцман спускается и говорит:\n- А спорим я хуем по стене крейсера стукну и тот развалится?\n\nКоманда соглашается. Боцман достает свой причендал и бьёт по борту корабля - взрыв.\nСреди мертвых тел и обломков крейсера за спасательный круг держится еле живой боцман, к нему подплывает капитан и говорит:\n- Ну ты и мудак ты, боцман. Торпеда мимо прошла",
    "Ахмед - сколько будет 5+5?\n- Десат\n- А 8+4?\n- Девьят\n- Неправильно\n- Восем\n- Блять, побежали отсюда",
    "Цирк. Конферансье объявляет:\n— Смертельный номер! Иван Повидлов будет есть говно!\nВыходит мужик в черном плаще на голое тело, высоких сапогах и в кожаных перчатках. Свет меркнет. Барабанная дробь. Из—за кулис выносят накрытый крышкой горшок. Актер снимает крышку, заглядывает внутрь, морщится, закрывает крышку, отдает горшок и уходит за кулисы.\nКонферансье:\n— Иван Повидлов есть говно не будет! Там волос!",
    "Приехал мужик в посёлок к чукчам машину продавать, все вышли вместе с главой посёлка посмотреть что же за машину будут им предлагать. Продавец говорит мол машина волшебная, сквозь стены домов может телепортироваться\n- не верю, однако, говорит глава посёлка. Мужик им и говорит: - все глаза закройте и когда откроете, то машина уже сквозь дом переместится. Закрыли глаза чукчи и пока ничего они не видели мужик перегнал машину за дом.\n- волшебство, однако, воскликнул глава посёлка и купил машину. Продавец уехал, а чукча захотел телепортироваться сквозь дом на машине, приказал всем чукчам закрыть глаза, сам разогнался на машине и врезался в стену дома. Машина вдребезги, дом покосился. Чукча вылазит из машины и злостно спрашивает: - какая билять глаза не закрыла???",
    "Пришел как-то грузин к экстрасенсу и говорит:\n– Слушай, дарагой, помоги а, неделя прошла, а голова все болит, помоги а!\n– Так я вижу у вас на голове растет волшебный волос. Только я не знаю где точно. Если загадать желание и вырвать его, то желание обязательно исполнится.\nПришел грузин домой сел на стул и начал вырывать волосы по одному и говорить: \"хочу новую \"волгу\", хочу новую \"волгу\"…\nИ остался один последний волосок, ему надоело и он подумал, что тот пид*р его на*бал, и он со злости крикнул:\n– Кинжал мне в ж*пу. А-а-а-а-а!",
    "Село, священник пялит прихожанку, и она естественно залетает. Собирается сельский совет, начинают разбираться.\n- Как вас вообще угораздило?\n- Дык, я аккуратно, на полшишечки, а тут этот окаянный звонарь как ударит в главный колокол, так я от неожиданности целиком -то и засунул!...\n- Отец Михаил, коли согрешили, так и ответьте по совести - женитесь!\n- Не могу я жениться, мне по сану не положено!\nВ общем, пошли на поводу у священника, повесили всю ответственность и алименты на звонаря.\nНовый день, звонарь докуривает самокрутку на колокольне, а потом орет во всю глотку:\n- Православныяя! Не ебёт ли кто кого!? УДАРЯЮ!!!",
    "Пара долго не могла забеременеть. Обошли тучу врачей, всё бестолку. Но тут узнали, что в соседнем лесу живёт знахарь, который лечит всё что угодно.\nПриезжают они к нему, заходят, а он им:\n«Мужики, вы чё ахуели?»",
    "Заказывает уставшая улитка такси после рабочего дня.\nПодъехала вообщем машина...\nДоезжают до места назначения.\nИ тут улитка говорит:\n- Остановите за углом пожалуйста, мне тут буквально 15 метров до дома.\nНу водитель и остановил.\nСпустя 3 дня улитка заходит домой, наливает себе виски, и думает про себя: \"Пиздец я долбаеб конечно\"",
    "Самая короткая речь адвоката в суде:\n\nСудили мальчика-гимназиста, ударившего ножом своего одноклассника.\nПричиной его отчаянного поступка была ежедневно возобновлявшаяся травля. Мальчик был очень волосатым. «Макака» — каждый день на протяжении нескольких лет приветствовал его пострадавший.\n\n\nАдвокат произнес самую короткую и, возможно, самую эффектную речь в своей адвокатской карьере. Вопрос судьи:\n- Признает ли вину обвиняемый?\n- КОНЕШНО — неожиданно для всех вскрикнул мальчик.\n\"Пидец\" сказал адвокат.",
    "Пришла как-то раз девушка в церковь, подходит к батюшке и говорит:\n— Батюшка, я согрешила...\n— Как согрешила?\n— Сосала\n— Сколько сосала?\n— 10 минут\n— Замаливай грехи 1 час\nНа следующий день:\n— Батюшка, я опять согрешила...\n— Как согрешила?\n— Сосала..\n— Сколько на этот раз?\n— Полчаса.\n— Замаливай грехи 3 часа.\nНа следующий день:\n— Батюшка, я опять согрешила.\n— Что, опять сосала?\n— Да..\n— Ох, сколько в этот раз?\n— 1 час 14 минут 38 секунд...\nПоп охреневший пошел в келью за калькулятором. Через пару минут возвращается, на ходу расстегивая ширинку:\n— Досасывай, а то дроби выходят",
    "Пришел юнга наниматься на китобойную шхуну. Старый шкипер объяснил ему обязанности, показал, где койка, рундук и камбуз, и т. д. — словом, договорились.\nА потом юнга спрашивает:\n— Сэр, плавание продлится полгода?\n— Точно, сынок.\n— А как же я буду обходиться без женщин столько времени?\n— Эх, молодо-зелено... Пошли.\nПривел шкипер юнгу в небольшую пустую каюту, где на одной стене превосходный рисунок голой женщины в натуральную величину с отверстием в интимном месте. — Ну вот сынок, любуйся.\n— А опробовать можно?\n— Опробуй.\nЮнга опробовал — понравилось.\n— А еще можно?\n— Можно.\n— И так каждый день??\n— Да, кроме четверга.\n— Почему кроме четверга???\n— А по четвергам твоя очередь с той стороны стоять.",
    "Приходит Работяга в ресторан, хочет отдохнуть на полученную зарплату\nОфициант объясняет ему правила\nМожно есть что угодно и вести себя как хочешь, но если у тебя не хватит потом денег расплатиться, то Палач отрубит тебе одну часть тела\nРаботяга весь день делал что пожелал, щипал официанток, заказывал себе еду, вел себя как хотел\nПотом снимает штаны и говорит чтобы позвали Палача\nПалач приходит и говорит, тебе ж еще он пригодится давай другую часть тела выбирай\nРаботяга ему отвечает что деньги у него еще есть и звал он Палача не для этого",
    "Лев царь зверей, провалился в яму и не может вылезти, если полезет без яиц останется. Тут заяц мимо проходит и лев говорит ему:\nЛ: заяц, помги застрял\nЗ: ага я тебе помгу , а ты меня потом схаваешь\nЛ: нет говорит, честное слово, сделаю тебя своей правой рукой\nЗ: ну ладно\nИ вот помог ему заяц, и на следующий день лев собирает собрание всех зверей и говорит\n\n\"Кто зайца обидет иметь дело будет со мной\"И вот идёт заяц первый день, как правой рукой льва стал и видет лису и говорит ей:\nЗ: рыжая, как насчёт миньета?\nЛиса: ты ч офигел что ли?\nЗ: ладно с левой дело будешь иметь\nЛиса подумала, подумала и пошли он в кусты, заяц довольный выходит, радуется.\nИдёт на второй день, смотрит волк и говорит ему:\nЗ: серый, как насчёт минькта?\nВ: ты ч офигел?\nЗ: ладно с левой дело иметь будешь\nВолк подумал и тоже в кусты пошёл, заяц опять довольный выходит, радуется\nИдёт на 3 день, видкт медведя, и говорит ему:\nЗ: косолапый как на счёт минькта?\nМ: ну пошли\nИ вот опять они в кусты ушли, через 10 минут заяц выбегает из кустов вытирая щеки, и орёт:\nБлин, заднеприводный на собрание не ходит.",
    "Едет поезд и вдруг съезжает с рельс, проскакивает лес, поле и вновь возвращается на рельсы. Пассажиры спрашивают у машиниста:\n– Что это было?\n– Едем, смотрю мужик на рельсах срёт.\n– Так давить надо было!\n– Так вот только в поле и догнал!",
    "Шли два рэпера. Один в кепке, другой тоже пиЗды получил",
    "Директор московского парка атракционов и директор нью-йоркского диснейленда поспорили у кого комната страха страшнее. Русский директор приехал в диснейленд, зашел в комнату страха. А там все стандартно, зомби, крики, ведьмы.\nАмериканец приехал в московский парк атракционов. Зашел в комнату страха, а там темно и длинный коридор. Идет по нему, идет, идет. Видит в далеке огонек. Идет к нему, уже подходит, а там узбек на кортах со свечкой сидит. Немая тишина, американец стоит, и тут узбек спрашивает:\n-Попу пыл?\n-Мыл.\nУзбек молча тушит свечку.",
    "Идет Мент по улице и видит, как маленькая Девочка в песочнице что-то лепит.— Девочка, а что ты лепишь?— Мента— А из чего?— Глина, песок, г@вно.Мент разозлился:— А ну, щас же сломай, а то к родителям отведу!Через некоторое время мент опять подходит.— Hу, а сейчас что лепишь?— Пожарника.— Из чего?— Глина, песок.Мент (ухмыляясь):— А почему без говна?Девочка:— А если г@вно добавить, опять мент получится...",
    "Идут Илья муромец, Алёша Попович и Добрыня Никитич, а на встречу им Мамай со своей ордой. Мамай думает: \n- Мы то их положем, но они мне пол орды перебьют, предложу им спор, они русские спорить любят.\nПодъезжает:\n- Мужики если ваши члены в сумме дадут 2 метра то я орду увожу, а нет - вы у всей орды сосать будете. \nУдарили по рукам. Илья вынул - полтора метра. \nДобрыня хоп - 45 сантиметров. \nАлёша вынул - 5 сантиметров. \nКороче 2 метра вышло. Увёл орду Чингисхан. \n\nИлья: \n- Вот если б у меня встал, то 3 метра было б и нас сразу же отпустили бы.\nДобрыня:\n - Если б у меня встал, то полтора метра было бы как пить дать.\nАлёша:\n- А если б у меня не встал, у всей орды бы сосали!",
    "Ночь. Звонок в дверь.\nМужик просыпается и сонным голосом спрашивает: \n- Кто там?\nИз-за двери:\n Жан Клод Ван Дамм!\nМужик:\n- Сейчас выйду всех четверых выебу!",
    "Приходит мужик на шоу «Ищем таланты». Здоровается жестами.\nВедущий:\n–Вы немой?\nМужик кивает и показывает жестами.\nВедущий:\n–А какой у вас талант?\nМужик:\n– Я могу говорить.",
    "Идут по пустыне Араб, Индус и Негр. День идут, два, три. Чуть живые поднимаються на бархан и видят оазис, а в нем дом стоит. Заходят в дом, а там крестьянин. Они ему и говорят:\n— Хозяин, пусти переночевать и воды попить.\nКрестьянин репу почесал и отвечает:\n— Всегда рад добрым людям, вот только кровати у меня свободных только две, поэтому кому-то придется ночевать в хлеву.\nАраб говорит:\n— Не вопрос, я пойду в хлев.\nУходит... Через пять минут стук в дверь. Открывают, на пороге араб:\n— Я не могу там спать, там свинья-грязное животное.\nИндус говорит:\n— Тогда я пойду.\nУходит... Через пять минут опять стук в дверь. Открывают, на пороге индус:\n— Я не могу там спать, там лошадь-священное животное.\nНегр говорит:\n— Тогда пойду я.\nУходит... Через пять минут стук в дверь. Открывают, на пороге стоят свинья и лошадь.",
    "Нашла жена золотую рыбку, рыбка ей говорит:\n-Отпусти меня, и я исполню любое твоё желание!\n-Хочу чтобы муж никогда не говорил слово \"нет\".\n-Готово!\nВозвращается жена домой и говорит мужу:\n-Дорогой, купи мне шубу\n-Пошла нахуй",
    "Летит орел. Из жопы у него вылезает червячок и спрашивает:\n–Командир, какая высота?\n–6 тысяч метров.\nГлист залезает обратно.\nЧерез полчаса опять: «Командир, какая высота?»\n–7 тысяч метров!\nТот обратно в жопу\nЕще через некоторое время: «Командир, какая высота?»\n–8 тысяч. Полет нормальный.\n–Ты, командир, только не обосрись. Экипаж волнуется.",
    "Армяне прячутся от разбойников в колодце.\nПриходят разбойники, заглядывают в колодец:\n— Есть здесь кто?\n— \"Есть здесь кто?\" – эхом отвечают Армяне.\n— А может и нет здесь никого?\n— \"А может и нет здесь никого?\" – доносится из колодца.\n— А может партию в нарды?\n— А давайте",
    "Стоит мужик на лестничной площадке, курит. Вдруг из соседней квартиры раздаются неистовые крики. Через некоторое время выходит сосед со сломанными 3D-очками. Мужик у него спрашивает:\n— Сосед, ты чего это расшумелся?\n— Да 3D-телевизор купил и разбил его нахер!\n— Зачем? — спрашивает удивленно мужик.\n— Да решил порнуху посмотреть, так пять раз чуть в рот не дали!",
    "Робинзон Крузо начал строить хижину в понедельник, а кончил в пятницу.",
    "Попадает коммунист в гей-клуб. Все в жёпы ебутся, танцуют под Азиса, сосутся на сцене. \nСпустя два часа выходит из клуба и спрашивает у вышибалы:\n- А итоги партсобрания где забрать можно?",
    "Дед с альцгеймером долго не понимал, кто насрал ему в штаны",
    "В купе вагона еврей и японец. Как только поезд тронулся, еврей доверительно спрашивает:\n— Скажите, вы, случайно, не еврей?\n— Что вы, я — японец. Еврей не отступает и через каждые 15—20 минут спрашивает:\n— Я вас прошу не стесняться, здесь мы одни. Скажите, ведь вы все же еврей? Когда японцу стало уже невмоготу, он говорит:\n— Да, да, я — еврей!\n— Странно... Вы так похожи на японца!\n— Да пошел ты нахуй, заебал",
    "Пришёл как-то мужик к венерологу, снимает штаны и говорит:\n— Доктор, скажите, что у меня там?\n— Пиздатый хуй, охуенные яйца",
    "По Чернобыльскому лесу огромными шагами идет Красная шапочка. Рост около трех метров, нога 49 размера, руки до колен, голова как тыква, груди разбросаны по всему телу. Навстречу волк. Она берет его за уши и поднимает к своему лицу. Сиплым голосом, но громко:\n– Наверное ты хотел меня сожрать?\n–Нет, нет, я вегетарианец!!! - взмолился тот.\n– Может быть трахнуть меня хотел?\n– Упаси бог, я гей!!!\nОна медленно опускает волка на уровень пояса:\n– Тогда соси!!!",
    "Настоящий джентльмен всегда отодвигает грязную посуду перед тем как нассать в раковину.",
    "Приходит мужик в больницу, говорит, что у него болит локоть. Доктор его отправляет сдавать анализ мочи. Мужик возмущенно:\n— Доктор, какая моча, локоть болит! На что доктор говорит:\n— Пришёл лечиться, сказали сдавать, значит сдавай, а не пререкайся.\nНу мужик озлобленный приходит домой, взял мочи у жены, у дочки, у тёщи, у кошки, воды с батареи отопления, добавил и тормозной жидкости с машины, потом пошел и сдал всю эту смесь на анализы. Приходит за результатом, доктор ему и говорит:\n— Кошка у вас абсолютно здорова, за неё можете не переживать. Батареям ремонт ещё не скоро понадобится. У тёщи развивается страшная болезнь, надо делать операцию, дорого и только за границей. За дочь не беспокойся, организм молодой сильный, несмотря на тринадцатилетний возраст, плод сформировался удачно, будет двойня. Чего не скажешь о жене, у жены твоей сифилис уже полгода, и в связи с болезнью она тебе не даёт, и ты в сортире дрочишь, а там тесно, локтем бьёшься, вот локоть и болит. Мужик встает и охуевший уходит. Доктор кричит ему вслед:\n— Ты еще тормозуху смени, а то убьёшься нахуй.",
    "Уборщица, которая не любит куни после душа:\n— ээээ куда по помытому",
    "Идут 2 грузина, один на встречу другому Один страшивает:\n— Гоги, ты где вчера был?\n— С Гиви в шахматы играли.\n— И кто кого?\n— Никто никого, я же говорю: в шахматы играли.",
    "В дверь постучали 256 раз.\n— 32 осьминога — подумал Штрилиц\n— Заебал, впусти — кричал Мюллер",
    "Один из управляющих концлагеря делает у себя ремонт в коттедже. Приходит, спрашивает:\n— Не знаете кто может плитку положить?\n— Там вон молдаван повели в газовую камеру, иди у них спроси, может успеешь.\nПрибегает, дверь газовой камеры уже закрывается, но управляющий успевает подставить ногу и спрашивает:\n— Мужики, можете плитку в доме положить?\n— Ну можем 200 рублей за квадрат\nУправляющий задумался\n— За 150 положите?\n— Ногу убрал",
    "Ставят мужику вакцину от короны в плечо, мужик спрашивает:\n— А можно в жопу?\n— Можно, но только после укола",
    "Как зовут попугая грузинского программиста?\n\nКэша",
    "Встречаются два приятеля:\n— Чё грустный такой?\n— Д-д-да н-н-на теле-теле-телевидиние х-х-ходил на ра-ра-работу устра-аиваться!\n— Кем?\n— Ди-ди-диктором!— И как?\n— Не-не-не взяли\n— Почему?\n— Д-д-да я ев-в-врей",
    "Однажды Платон сказал:\n– Человек есть животное о двух ногах, лишённое перьев.\nЭто услышал Диоген, ощипал петуха и показал Платону:\n– Вот платоновский человек\nПлатон ответил:\n– Ебать, ты душнила конченая, иди нахуй отсюда, нищеёб поганый\nИ разнёс Диогену хату",
    "Сидит заяц под деревом, дрочит и поет песню: \"маленькая страна....\"\nИдет медведь. Увидел зайца и говорит:\n- Ты что делаешь, заяц?\n- Да вот дрочу, песню пою!\n- А можно мне с тобой!\n- Да присаживайся, в чем проблема!\nМедведь сел рядышком, вывалил свое хозяйство и запел: большие города.......",
    "Бабка, наркоман и моряк едут в автобусе. Бабуля просит наркомана открыть форточку, тот поворачивается к моряку и говорит:\n— Эй, солдат, форточку открой, жарко же!\nА тот ему:\n— Какой же я тебе солдат, я моряк.\nНаркоман поворачивается к бабке:\n— Бабка, форточка отменяется, мы на подводной лодке. За такое и посадить могут",
    "Пять англичан в Ауди Quattro приехали на пост российской границы. Таможенник останавливает их и говорит:\n— Впятером в Quattro ездить нельзя.\n— Почему нельзя?!\n— Quattro значит четыре.\n— Quattro просто название автомобиля, — пытается возразить англичанин, не веря своим ушам. — Посмотрите в документы, эта машина рассчитана на пятерых.\n— Не надо мне рассказывать, — говорит таможенник. — Quattro значит четыре. У вас в машине 5 человек, значит вы нарушаете закон.\n— Идиот!!! Позовите начальника, я поговорю с кем-нибудь кто поумнее на этой таможне!\n— Извините, начальник занят. Он выясняет какого хуя в УАЗ Патриот залез либерал.",
    "Заходит в бар для вампиров богатый вампир-аристократ, и говорит:\n- Мне пожалуйста кровь девственницы, четвертую группу.\nВыпивает и уходит.\nЗаходит вампир среднего достатка:\n- Мне кровь первой группы.\nВыпивает и уходит.\nЗаходит бомж-вампир:\n- Мне пожалуйста стакан кипятка.\nЕму наливают, после чего он достаёт тампон со словами:\n- Чайком побалуемся!",
    "Едут солдаты на танке, и у танка гусеница порвалась... \nЧертыхаясь иматерясь, они принимаются за починку. Вдруг подлетает обворожительно красивая добрая фея и звенящим голоском спрашивает:\n— Мальчики, а что вы здесь делаете?\n— Не видишь: с гусеницей ебёмся!!\n— Бедненькие мои. A по-настоящему поебаться хотите?\n— Кто ж не хочет! — обрадовались танкисты.\nВзмахнула тогда добрая фея палочкой и у танка башня отвалилась.",
    "Урок в школе. Неизменная Марья Ивановна:\n— Дети, что можно получить от курицы? Машенька!\n— Яйца.\n— Хорошо. Петенька!\n— Мясо.\n— Молодец. Ну а ты, Вовочка, что скажешь?\n— Не знаю.\n— Ну как же, Вовочка. Вот ты на чем спишь?\n— На лавке.\n— А под голову что кладешь?\n— Валенок.\n— Та-ак... А папа твой где спит?\n— На полу.\n— А под голову что кладет?\n— Второй валенок.\n— Ну а дедушка твой где спит?!!!\n— На печи.\n— А под голову что кладет?\n— Подушку.\n— Вот! А что можно получить, если подушку разрезать?\n— Пизды от деда",
    "Заходят русский и украниец в бар. Просят бармена налить по стопке. Молча выпивают. Один другому:\n— Чёт как-то и не смешно уже\n— Согласен",
    "Мужик заходит в зоомагазин за белыми мышками для своего удава. Видит\n- клетка с попугаем, ну он подошел поглазеть. Попугай:\n- Ширрринка рррастегнута!\nМужик краснеет, отворачивается застегнуть.\n- Дырррка в брррюках!\nМужик еще сильней краснеет и пытается прикрыть рукой задницу.\n- Шнурррок ррразвязан!\nМужик нагибается завязать.\n- Ты перррнул!\nТот, красный как свекла, вылетает из магазина. Голос из клетки с мышами:\n- Инокентич, с нас как обычно.",
    "«Парень, как тебя зовут?» - спросил учитель.\n«Мухаммед» - ответил он.\n«Теперь ты живёшь в Ирландии. С этого момента тебя будут звать Майкл.»\nМухаммед вернулся домой после школы.\n«Как прошёл первый день в школе, Мухаммед?» - спросила его мать.\n«Меня зовут не Мухаммед, теперь мы живем в Ирландии, и с этого момента зови меня Майклом.»\n«Ты стыдишься своего имени? Ты хочешь предать своих родителей, свою родину, свои религию? КАК ТЫ СМЕЕШЬ?»\nМать выбила из него все дерьмо, затем позвала отца, чтобы тот повторил процедуру.\nНа следующий день он вернулся в школу, где учитель увидел на нем свежие следы побоев.\n«Что случилось, Майкл?» - спросил учитель.\n«Сразу после того, как я стал Ирландцем, меня избили два ёбаных араба»",
    "Однажды один человек встретил джина, и тот сказал ему:\n\n— Я исполню любые твои желания, но что бы ты не загадал, твой сосед, которого ты ненавидишь, получит вдвое больше.\n— Хочу знать сколько у моего соседа благ в условных единицах\n— Че? Ну так и быть, допустим 2540 условных единиц. Сосед твой теперь знает сколько таких единиц у двух своих соседей\n— Отлично, а сколько таких же единиц благ у меня?\n— Да че ты мутишь блять? Ну 4120. Теперь твой сосед знает сколько у него таких единиц, и знает это вдвое лучше тебя. Ещё что-то, Мавроди ты ебучий?\n— Хочу уменьшить свое благосостояние на 1770 условных единиц\n— Ааааа бля, ну ты гнидыч, теперь у тебя 2350 единиц, а у соседа их 0 нахуй\n— Супер, теперь хочу увеличить свое состояние в 100000 раз, а так как у соседа единиц 0, то и получит он в итоге 0. Как тебе такое, джин?\n\nНу джин прихуел с такой наглости, взглянул на звезды, щелкнул пальцами и начал яростно ебать мужика в очко. Ебет и приговаривает:\n— Что тебе не нравится? В джиновой системе счисления это высшее благо!",
    "Показывает доктор человеку картинку с тремя охотниками на привале.\n- Что можете сказать про изображение?\n- Пидорасы! Выпить и закусить есть, а баб нету, точно пидорасы!\n- Ну хорошо, а про эту? (показывает картинку с птицами, летящими клином)\n- Тоже пидорасы! Все друг другу в жопу смотрят!\n- А что мне ещё скажете?\n- И ты пидорас!\n- Почему?\n- А че ты мне картинки с пидорасами показываешь?",
    "Война между Арменией и Азербайджаном. Поймали азербайджанцы армянина и давай\nпытать его - где, мол, ваши... (произносится грубым низким голосом с характерным\nакцентом...)\n- Будиш гаварыть?\n- Нет.\n- Питать будем, лутше гавары!\n- Нет.\n- Ладно. Эй, Магомед, ну-ка сунь ему...\n- ...\n- Будиш гаварыть?\n- НЕТ.\n- Магомед, сунь ему еще...\n- ...,...\n- БУДИШ ГАВАРЫТЬ?\n- НЕТ!\n- МАГОМЕД!..\n- ...\n- БУДИШ ГАВАРЫТ, САБАКА, ПАСЛЕДНЫЙ РАС СПРАШИВАЕМ?!!?!\n- ДА, ДА, ДА...\n- ГАВАРЫ.\n- О-О-О! Я ЛУБЛУ ТЭБЬЯ, МАГОМЕД!",
    "Прибегает сосед и говорит:\n-У тебя лошадь курит?\n-Нет\n-Тогда у тебя сарай горит",
    "Сидит Василий Иванович, бреется. Вдруг звонит звонок. Он открывает дверь, на пороге стоит изысканно одетая девушка.\n- Питер дома?\n- Чего?\n- Питер дома?\n- Петька, что ли? Нету!\n- Передайте ему, что у меня сегодня вечером дебют. Пусть приходит поближе познакомиться со своим идеалом.\nВечером приползает пьяный Петька. Василий Иванович ему:\n- Слышь, Петька! Твоя блядь заходила, сказала, что ты пидор, что ее сегодня вечером ебут и чтоб ты приходил со своим одеялом!",
    "В Армении:\n-Ало, секс по телефону?\n-Да, брат",
    "На улице в Каире, неподалёку от мечети, сидят двое нищих. Перед каждым из них чашка для монет и табличка. У одного написано: «Подайте бедному еврею», у второго: «Во имя Аллаха милосердного, подайте арабу, раненому на войне с Израилем».",
    "Люди, выходящие из мечети, демонстративно проходят мимо еврея, чтобы бросить несколько монет арабу.\nКакой-то турист, глядя на пустую чашку перед евреем, тихонько подсказывает ему:\n— Слушай, смени надпись, а то ведь останешься голодным. Напиши, что ты тоже араб.",
    "Когда прохожий ушёл, еврей поворачивается к своему соседу и возмущённо говорит:\n— Ты слышал, Изя? Он таки собирается учить нас коммерции!",
    "ЖАРА. ПУСТЫНЯ. ПО ПУСТЫНЕ НА ВЕРБЛЮДЕ МЕДЛЕНО ЕДЕТ ВСПОТЕВШИЙ ХОХОЛ.\nТУТ ХОХЛА НА СКОРОСТИ ОБЪЕЗЖАЕТ МОТОЦИКЛИСТ.\n— СТОЯТИ. ТИ ЧОГО ЦЕ В ТАКУ ЖАРУ ПО ПУСТЫНЕ ГОНИШ?\n— ТЫ ЧЕГО, НЕ ЗНАЕШЬ ЗАКОНОВ ФИЗИКИ: ЧЕМ БЫСТРЕЕ ЕДЕШЬ, ТЕМ ТЕБЕ ПРОХЛАДНЕЙ.\n— ДА НУ. - ХОХОЛ БЬЕТ ВЕРБЛЮДА, И НА СКОРОСТИ ОТРЫВАЕТСЯ ОТ МОТОЦИКЛИСТА.\nЧЕРЕЗ ДВА КИЛОМЕТРА МОТОЦИКЛИСТ ДОГОНЯЕТ ХОХЛА. ХОХОЛ СТОИТ НАД ТРУПОМ ВЕРБЛЮДА И ПЛАЧЕТ.\n— ЧТО СЛУЧИЛОСЬ!?\n.\n.\n.\n.\n.\n\n— ЕБАЛ Я ТВОЇ ЗАКОНИ ФІЗИКИ, У МЕНЕ ВЕРБЛЮД ЗАМЕРЗ.",
    "Как говорил Эйнштейн: Я не знаю чем будет вестись третья мировая война, но на четвертую я вообще хуй клал бля.",
    "Пошел как-то раз дед в баню. И так распарился, что, надо же, - член встал.\nДед бегом в избу с криком:\n- Бабка! Бабка!\nВлетает в избу, а бабка на него вытаращилась, спрашивает:\n- Ты чего?\nДед орет:\n- Как чего?! Встал! Давай раздевайся скорее!\nБабка давай раздеваться, а член-то тем временем и упал. Расстроились оба, дед\nи предлагает:\n- Как следующий раз пойду в баню и увидишь, что бегу, так сразу задирай юбку и становись в позу.\nДоговорились. На следующий раз дед идет в баню, бабка у окна сидит - ждет. Вдруг\nвидит - дед летит, - задирает юбку, становится раком.\nДед влетает в избу и хрясь! Со всего маха бабке сапогом по жопе и как заорет:\n- Всё бы тебе ебаться, дура старая, а у нас там сарай горит!!!",
    "Стоит муж на кухне, пельмени лепит. Тут вваливается пьянющая в хлам жена:\n— О, у нас пелемешки будут?\nМуж:\n— Алкоголичка чёртова, опять нажралась! Сходи лучше к соседям, в доме соль закончилась.Ну, вышла жена во двор, огляделась — до калитки далеко, дай, думает, через забор перелезу. Начала перелазить, ногой зацепилась, и обратно на землю упала. \nБудучи в полной уверенности, что находится на соседском участке, поднимается, отряхивается, стучит в дверь, заходит:\n— О, и у Вас пелемешки?\nМуж:\n— Ты чё, ебанулась?\n— А Вы что, в окно видели?",
    "В деpевне закончилась свадьба. Ванька наконец-то уединился за занавесочкой на\nкpовати с Манькой. А на печке на полатях дед. Ванька pьяно пpиступает к исполнению супpужеских обязанностей. Час спустя Манька не выдеpживает и оpет:\n— Ванька, да не можу я больше! Помpу щас...\nДед с полатей подает голос:\n— Hе веpь, Ванька! От этого дела никто еще не помиpал.\nПpоходит еще паpа часов. Ванька не унимается. Манька снова кpичит истошным\nголосом:\n— Ой, Ваня! Hу, отвяжись — не можу я больше. Щас обосpусь!\nДед с полатей:\n— Вань, а этому повеpь. Это бывает...",
    "На Тегеранской конференции Черчилль, чтобы позлить Сталина, сказал:\n– А мне сегодня приснилось, что меня назначили президентом Земли\nРузвельт поддакнул:\n– А мне приснилось, что меня назначили президентом Вселенной\nСталин медленно закурил трубку и спокойно ответил:\n– А я перднул",
    "Французский посол на одной из выпивок у Александра III спрашивает:\n— Ваше величество, это правда, что у вас в России гречку едят?\n— Да, а что?\n— А у нас во Франции эту гадость только скотине дают.\nАлександр III, почесав затылок, спрашивает у посла:\n— Мосье, это правда, что у вас во Франции лягушек едят?\n— Да, а что?\n— А я когда твою маму ебал, так она аж квакала от удовольствия, вот что",
    "Два мента заходят в забегаловку с собакой. Сели, пообедали, поболтали и собрались уходить. На выходе один из ментов поднимает собаке заднюю лапу и долго смотрит под брюхо. Второй его спрашивает:\n— Ты чё делаешь?\nПервый отвечает:\n— Да мы когда зашли, слышал как один официант другому сказал: \"Смотри, собака с двумя хуями идет\"",
    "В одном селении на свадьбе тамада перепил шампанского и его стало немного пучить. А по ходу дела он должен был вскоре выстрелить из пистолета. Тогда тамада додумался под шумок выстрела и освободиться от мучившей его напасти. Но, о боже, пистолет дал осечку. Красный от стыда тамада убежал в горы и скрывался там десять лет. Затем он все таки решился спуститься, думая, что все давно уже забыто. Придя в село, он встретил маленького мальчика:\n— Мальчик! Здравствуй! Я давно у вас не был. Что тут новенького произошло за последнее время?\n— С тех пор, как тамада пернул, ничего особенного не произошло.",
    "Штирлиц забегает в бар с топором и кричит:\n— Порублю, суки!\nСуки скинулись по рублю, и Штирлиц ушел.",
    "Лежат заключённые на нарах, после отбоя. Вдруг, из одного угла слышится: 14.\nВся камера начинает заливисто смеяться.\nИз другого угла: 37.\nКамера опять ржёт.\nНовенький арестант спрашивает у лежащего рядом старожила:\n- А че это за цифры из-за которых все в камере смеются?\nСтарый отвечает:\n- Понимаешь, кореш, давно тут сидим, все анекдоты уже рассказали и, чтобы не повторять каждый раз, присвоили им номера. Называет кто-то номер анекдота, а все остальные вспоминают и смеются.\nНовенький на всю камеру: 19!\nвсе смеются до смерти, аж на землю падают.\nОн опять к старожилу:\n- Неужели анекдот 19 настолько смешной?\nСтарожил:\n- Не, просто его мы впервые слышим!",
    "Робин Гуд впадал в ступор, встречая людей среднего достатка",
    "В Чечню привезли шоу с крокодилами. Было ну очень страшно! Но, переборов страх, крокодилы все-таки выступили",
    "Почему программист никогда не голодает? Потому что у него всегда есть печеньки (cookies)!",
    "Как программист поднимает бокал? 'Поднимаем toasts!'",
    "Встречаются два айтишника. Один говорит: 'У меня все плохо'. Другой: 'format c: и начни сначала!'",
    "Почему программисты не любят природу? Слишком много багов.",
    "Как программист выбирает суп? Главное, чтобы не было утечек памяти.",
    "Почему программист спит под одеялом? Чтобы не было утечек данных.",
    "Зачем программист ест за компьютером? Чтобы не отрываться от работы.",
    "Как программист выключает свет? Через командную строку!",
    "Почему в офисе программиста нет зеркал? Отражения ему и так хватает в коде.",
    "Чем отличается программист от математика? Математик решает задачи, а программист их дебажит.",
    "Как программист готовит ужин? Заказывает доставку и пишет скрипт ожидания.",
    "Почему программисты не любят отпуск? Непонятно, где искать баги вне офиса.",
    "Что делает программист, если потерял ключи от дома? Проверяет в кэше.",
    "Почему программисты редко улыбаются? Потому что у них 'if not happy: continue'.",
    "Что общего между программистом и художником? Оба работают с палитрами.",
    "Почему программисту легко похудеть? Он знает, как удалять лишний вес через консоль.",
    "Зачем программисту нужен термос? Чтобы сохранять переменные температуры.",
    "Как программист пишет письмо? 'Dear recipient, здесь должен быть текст...'",
    "Почему программисты плохо танцуют? Потому что они считают шаги.",
    "Почему программисты любят темные темы? Меньше света — меньше багов.",
    "Что говорит программист в магазине? 'Где тут ваше API для оплаты?'",
    "Почему программисту не нужен ежедневник? Он просто пишет todo-list в коде.",
    "Как программист лечит головную боль? Перезагружает мозг.",
    "Почему программисты не любят кошек? У них слишком много лишних переменных.",
    "Как программист поднимает настроение? Перезагружает день!",
    "Едут Гена и Чебурашка на двухместном велосипеде. Гена говорит:\n- Чебурашка, если увидишь ментов, кричи \"Гена!!!\"\nЕдут дальше\nВдруг у Чебурашки яйца за заколесо цепляются, он орет:\n- Гена!!! Гена!!!\nЗаехали за угол, Гена спрашивает:\n- Оторвались?\n- Оторвались(((",
    "Митинг косоглазых состоялся на 40 метров левее здания администрации",
    "Кодекс пирата, правило 13:\nНе кушай много арбуза\nОбсикаешься ночью"
]